Revit 2026 API

# MacroModuleGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<Macro> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of Macro)
```
```cpp
public:
virtual IEnumerator<Macro^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<Macro>
override GetEnumerator : unit -> IEnumerator<Macro>
```

#### Return Value

IEnumeratorMacroAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

MacroModule Class

Autodesk.Revit.DB.Macros Namespace